aniline/rf24-esp8266/user/RF24.c
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "ets_sys.h"

#include "nRF24L01.h"
#include "RF24_config.h"
#include "RF24.h"

#include "gpio.h"
#include "driver/spi.h"
#include "driver/spi_register.h"

/* Only one instance, currently */
uint8_t ce_pin;
uint8_t csn_pin;
bool p_variant;
uint8_t payload_size;
bool dynamic_payloads_enabled;
uint8_t pipe0_reading_address[5];
uint8_t addr_width;

#if defined (__XTENSA__)

/* Defines to look like 'wiring' library */
#define HIGH 1
#define LOW 0
#define delay(x) ets_delay_us((x) * 1000)
#define delayMicroseconds ets_delay_us
#define min(a, b) ((a) > (b) ? (b) : (a))

LOCAL void ICACHE_FLASH_ATTR
SPI_begin () {
     spi_master_init(HSPI);
     /* 1 Mhz-ish clock, I think */
     WRITE_PERI_REG( SPI_CLOCK(HSPI),
		    (((0x40) & SPI_CLKDIV_PRE) << SPI_CLKDIV_PRE_S)|
		    ((3 & SPI_CLKCNT_N) << SPI_CLKCNT_N_S)|
		    ((1 & SPI_CLKCNT_H) << SPI_CLKCNT_H_S)|
		    ((3 & SPI_CLKCNT_L) << SPI_CLKCNT_L_S));
}

LOCAL unsigned char ICACHE_FLASH_ATTR
SPI_transfer (unsigned char v) {
     unsigned char d = 0;

     while (READ_PERI_REG(SPI_CMD(HSPI)) & SPI_USR);

     /* BIT(0) from Old SDK (IN and OUT) to do duplex transfer, disable all other
      * bytes (MISO - happens when set to MOSI and duplex,
      * COMMAND, ADDR, DUMMY */
     SET_PERI_REG_MASK(SPI_USER(HSPI), SPI_USR_MOSI | BIT(0) );
     CLEAR_PERI_REG_MASK(SPI_USER(HSPI),
			 SPI_USR_MISO |
			 SPI_USR_COMMAND |
			 SPI_USR_ADDR |
			 SPI_USR_DUMMY);

     /* 8 bit xfers */
     WRITE_PERI_REG(SPI_USER1(HSPI),
		    ((7 & SPI_USR_MOSI_BITLEN) << SPI_USR_MOSI_BITLEN_S) |
		    ((7 & SPI_USR_MISO_BITLEN) << SPI_USR_MISO_BITLEN_S));

     /* To send */
     WRITE_PERI_REG(SPI_W0(HSPI), (uint32)(v));
     SET_PERI_REG_MASK(SPI_CMD(HSPI), SPI_USR);

     /* Wait for operation (read included) to complete */
     while (READ_PERI_REG(SPI_CMD(HSPI))&SPI_USR);
     d = (uint8)(READ_PERI_REG(SPI_W0(HSPI))&0xff);

     return d;
}

LOCAL long ICACHE_FLASH_ATTR
millis() {
     uint32 us = system_get_time() / 1000;
     return us;
}

#endif

/****************************************************************************/

void ICACHE_FLASH_ATTR
csn(bool mode)
{
	// Minimum ideal SPI bus speed is 2x data rate
	// If we assume 2Mbs data rate and 16Mhz clock, a
	// divider of 4 is the minimum we want.
	// CLK:BUS 8Mhz:2Mhz, 16Mhz:4Mhz, or 20Mhz:5Mhz
  GPIO_OUTPUT_SET(csn_pin, mode);
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
ce(bool level)
{
  GPIO_OUTPUT_SET(ce_pin, level);
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_read_register_v(uint8_t reg, uint8_t* buf, uint8_t len)
{
  uint8_t status;

  csn(LOW);
  status = SPI_transfer( R_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- ){
    *buf++ = SPI_transfer(0xff);
  }
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_read_register(uint8_t reg)
{

  csn(LOW);
  SPI_transfer( R_REGISTER | ( REGISTER_MASK & reg ) );
  uint8_t result = SPI_transfer(0xff);
  csn(HIGH);

  return result;
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_write_register_v(uint8_t reg, const uint8_t* buf, uint8_t len)
{
  uint8_t status;

  csn(LOW);
  status = SPI_transfer( W_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- )
    SPI_transfer(*buf++);

  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_write_register(uint8_t reg, uint8_t value)
{
  uint8_t status;

  csn(LOW);
  status = SPI_transfer( W_REGISTER | ( REGISTER_MASK & reg ) );
  SPI_transfer(value);
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_write_payload(const void* buf, uint8_t data_len, const uint8_t writeType)
{
  uint8_t status;
  const uint8_t* current = (const uint8_t*)(buf);

  if(data_len > 32) data_len = 32;
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : 32 - data_len;

  csn(LOW);
  status = SPI_transfer( writeType );
  while ( data_len-- ) {
    SPI_transfer(*current++);
  }
  while ( blank_len-- ) {
    SPI_transfer(0);
  }
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_read_payload(void* buf, uint8_t data_len)
{
  uint8_t status;
  uint8_t* current = (uint8_t*)(buf);

  if(data_len > payload_size) data_len = payload_size;
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : 32 - data_len;

	//printf("[Reading %u bytes %u blanks]",data_len,blank_len);

  csn(LOW);
  status = SPI_transfer( R_RX_PAYLOAD );
  while ( data_len-- ) {
    *current++ = SPI_transfer(0xFF);
  }
  while ( blank_len-- ) {
    SPI_transfer(0xff);
  }
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
flush_rx(void)
{
  return rf24_spiTrans( FLUSH_RX );
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
flush_tx(void)
{
  return rf24_spiTrans( FLUSH_TX );
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_spiTrans(uint8_t cmd){

  uint8_t status;

  csn(LOW);
  status = SPI_transfer( cmd );
  csn(HIGH);

  return status;

}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_get_status(void)
{
  return rf24_spiTrans(NOP);
}

#ifndef MINIMAL_NO_TEXT
/****************************************************************************/
void ICACHE_FLASH_ATTR
rf24_print_status(uint8_t status)
{
     printf_P(PSTR("STATUS\t\t = 0x%02x RX_DR=%x TX_DS=%x MAX_RT=%x RX_P_NO=%x TX_FULL=%x\r\n"),
           status,
           (status & _BV(RX_DR))?1:0,
           (status & _BV(TX_DS))?1:0,
           (status & _BV(MAX_RT))?1:0,
           ((status >> RX_P_NO) & 0b111),
           (status & _BV(TX_FULL))?1:0
          );
}

