aniline/rf24-esp8266/user/RF24.c
/****************************************************************************/

void rf24_print_observe_tx(uint8_t value)
{
	// printf_P(PSTR("OBSERVE_TX=%02x: POLS_CNT=%x ARC_CNT=%x\r\n"),
	//          value,
	//          (value >> PLOS_CNT) & B1111,
	//          (value >> ARC_CNT) & B1111
	//         );
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_print_byte_register(const char* name, uint8_t reg, uint8_t qty)
{
     char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
     printf_P(PSTR(PRIPSTR"\t%c ="),name,extra_tab);
     while (qty--)
	  printf_P(PSTR(" 0x%02x"),rf24_read_register(reg++));
     printf_P(PSTR("\r\n"));
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_print_address_register(const char* name, uint8_t reg, uint8_t qty)
{
  char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
  printf_P(PSTR(PRIPSTR"\t%c ="),name,extra_tab);

  while (qty--)
  {
    uint8_t buffer[addr_width];
    rf24_read_register_v(reg++,buffer,sizeof buffer);

    printf_P(PSTR(" 0x"));
    uint8_t* bufptr = buffer + sizeof buffer;
    while( --bufptr >= buffer ) {
      printf_P(PSTR("%02x"),*bufptr);
    }
  }

  printf_P(PSTR("\r\n"));
}
#endif

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_init(uint8_t _cepin, uint8_t _cspin)
{
     ce_pin = _cepin;
     csn_pin = _cspin;
     p_variant = false;
     payload_size = 32;
     dynamic_payloads_enabled = false;
     addr_width = 5;	//,pipe0_reading_address(0);
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_setChannel(uint8_t channel)
{
  const uint8_t max_channel = 127;
  rf24_write_register(RF_CH,min(channel,max_channel));
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_setPayloadSize(uint8_t size)
{
  payload_size = min(size,32);
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_getPayloadSize(void)
{
  return payload_size;
}

/****************************************************************************/

#if !defined (MINIMAL_NO_TEXT)

static const char rf24_datarate_e_str_0[] PROGMEM = "1MBPS";
static const char rf24_datarate_e_str_1[] PROGMEM = "2MBPS";
static const char rf24_datarate_e_str_2[] PROGMEM = "250KBPS";
static const char * const rf24_datarate_e_str_P[] PROGMEM = {
  rf24_datarate_e_str_0,
  rf24_datarate_e_str_1,
  rf24_datarate_e_str_2,
};
static const char rf24_model_e_str_0[] PROGMEM = "nRF24L01";
static const char rf24_model_e_str_1[] PROGMEM = "nRF24L01+";
static const char * const rf24_model_e_str_P[] PROGMEM = {
  rf24_model_e_str_0,
  rf24_model_e_str_1,
};
static const char rf24_crclength_e_str_0[] PROGMEM = "Disabled";
static const char rf24_crclength_e_str_1[] PROGMEM = "8 bits";
static const char rf24_crclength_e_str_2[] PROGMEM = "16 bits" ;
static const char * const rf24_crclength_e_str_P[] PROGMEM = {
  rf24_crclength_e_str_0,
  rf24_crclength_e_str_1,
  rf24_crclength_e_str_2,
};
static const char rf24_pa_dbm_e_str_0[] PROGMEM = "PA_MIN";
static const char rf24_pa_dbm_e_str_1[] PROGMEM = "PA_LOW";
static const char rf24_pa_dbm_e_str_2[] PROGMEM = "PA_HIGH";
static const char rf24_pa_dbm_e_str_3[] PROGMEM = "PA_MAX";
static const char * const rf24_pa_dbm_e_str_P[] PROGMEM = {
  rf24_pa_dbm_e_str_0,
  rf24_pa_dbm_e_str_1,
  rf24_pa_dbm_e_str_2,
  rf24_pa_dbm_e_str_3,
};

void ICACHE_FLASH_ATTR
rf24_printDetails(void)
{
  rf24_print_status(rf24_get_status());

  rf24_print_address_register(PSTR("RX_ADDR_P0-1"),RX_ADDR_P0,2);
  rf24_print_byte_register(PSTR("RX_ADDR_P2-5"),RX_ADDR_P2,4);
  rf24_print_address_register(PSTR("TX_ADDR"),TX_ADDR, 1);

  rf24_print_byte_register(PSTR("RX_PW_P0-6"),RX_PW_P0,6);
  rf24_print_byte_register(PSTR("EN_AA"),EN_AA, 1);
  rf24_print_byte_register(PSTR("EN_RXADDR"),EN_RXADDR, 1);
  rf24_print_byte_register(PSTR("RF_CH"),RF_CH, 1);
  rf24_print_byte_register(PSTR("RF_SETUP"),RF_SETUP, 1);
  rf24_print_byte_register(PSTR("CONFIG"),CONFIG, 1);
  rf24_print_byte_register(PSTR("DYNPD/FEATURE"),DYNPD,2);

#if defined(__arm__)
  printf_P(PSTR("Data Rate\t = %s\r\n"),pgm_read_word(&rf24_datarate_e_str_P[getDataRate()]));
  printf_P(PSTR("Model\t\t = %s\r\n"),pgm_read_word(&rf24_model_e_str_P[isPVariant()]));
  printf_P(PSTR("CRC Length\t = %s\r\n"),pgm_read_word(&rf24_crclength_e_str_P[getCRCLength()]));
  printf_P(PSTR("PA Power\t = %s\r\n"),pgm_read_word(&rf24_pa_dbm_e_str_P[getPALevel()]));
#elif defined (__XTENSA__)
  printf("Data Rate\t = %s\r\n",rf24_datarate_e_str_P[rf24_getDataRate()]);
  printf("Model\t\t = %s\r\n",rf24_model_e_str_P[rf24_isPVariant()]);
  printf("CRC Length\t = %s\r\n",rf24_crclength_e_str_P[rf24_getCRCLength()]);
  printf("PA Power\t = %s\r\n",rf24_pa_dbm_e_str_P[rf24_getPALevel()]);
#else
  printf_P(PSTR("Data Rate\t = %S\r\n"),pgm_read_word(&rf24_datarate_e_str_P[getDataRate()]));
  printf_P(PSTR("Model\t\t = %S\r\n"),pgm_read_word(&rf24_model_e_str_P[isPVariant()]));
  printf_P(PSTR("CRC Length\t = %S\r\n"),pgm_read_word(&rf24_crclength_e_str_P[getCRCLength()]));
  printf_P(PSTR("PA Power\t = %S\r\n"),pgm_read_word(&rf24_pa_dbm_e_str_P[getPALevel()]));
#endif
}

#endif
/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_begin(void)
{
  SPI_begin();
  gpio_init ();
	// Initialize pins
  /* TODO: Have to move this out */
  PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO4_U, FUNC_GPIO4);
  PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO5_U, FUNC_GPIO5);
  gpio_output_set(BIT5, BIT4, BIT4 | BIT5, 0);

  ce(LOW);
  csn(HIGH);

	// Must allow the radio time to settle else configuration bits will not necessarily stick.
	// This is actually only required following power up but some settling time also appears to
	// be required after resets too. For full coverage, we'll always assume the worst.
	// Enabling 16b CRC is by far the most obvious case if the wrong timing is used - or skipped.
	// Technically we require 4.5ms + 14us as a worst case. We'll just call it 5ms for good measure.
	// WARNING: Delay is based on P-variant whereby non-P *may* require different timing.
  delay( 5 ) ;

	// Set 1500uS (minimum for 32B payload in ESB@250KBPS) timeouts, to make testing a little easier
	// WARNING: If this is ever lowered, either 250KBS mode with AA is broken or maximum packet
	// sizes must never be used. See documentation for a more complete explanation.
  rf24_setRetries(5,15);

	// Reset value is MAX
	//setPALevel( RF24_PA_MAX ) ;

	// Determine if this is a p or non-p RF24 module and then
	// reset our data rate back to default value. This works
	// because a non-P variant won't allow the data rate to
	// be set to 250Kbps.
  if( rf24_setDataRate( RF24_250KBPS ) )
  {
    p_variant = true ;
  }

