aniline/rf24-esp8266/user/RF24.c
	// Then set the data rate to the slowest (and most reliable) speed supported by all
	// hardware.
  rf24_setDataRate( RF24_1MBPS ) ;

	// Initialize CRC and request 2-byte (16bit) CRC
  rf24_setCRCLength( RF24_CRC_16 ) ;

	// Disable dynamic payloads, to match dynamic_payloads_enabled setting - Reset value is 0
	//rf24_write_register(DYNPD,0);

	// Reset current status
	// Notice reset and flush is the last thing we do
  rf24_write_register(STATUS,_BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

	// Set up default configuration.  Callers can always change it later.
	// This channel should be universally safe and not bleed over into adjacent
	// spectrum.
  rf24_setChannel(76);

	// Flush buffers
  flush_rx();
  flush_tx();

  rf24_powerUp();	//Power up by default when begin() is called

	// Enable PTX, do not write CE high so radio will remain in standby I mode ( 130us max to transition to RX or TX instead of 1500us from rf24_powerUp )
	// PTX should use only 22uA of power
  rf24_write_register(CONFIG, ( rf24_read_register(CONFIG) ) & ~_BV(PRIM_RX) );

}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_startListening(void)
{
  rf24_powerUp();
  rf24_write_register(CONFIG, rf24_read_register(CONFIG) | _BV(PRIM_RX));
  rf24_write_register(STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

	// Restore the pipe0 adddress, if exists
  if (pipe0_reading_address[0] > 0){
    rf24_write_register_v(RX_ADDR_P0, pipe0_reading_address, addr_width);
  }

	// Flush buffers
	//flush_rx();
  flush_tx();

	// Go!
  ce(HIGH);

}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_stopListening(void)
{

  ce(LOW);
  #if defined(__arm__)
  delayMicroseconds(130);
  #endif
  flush_tx();
	//flush_rx();

  rf24_write_register(CONFIG, ( rf24_read_register(CONFIG) ) & ~_BV(PRIM_RX) );
  delayMicroseconds(130);	//Found that adding this delay back actually increases response time
}

/****************************************************************************/

void rf24_powerDown(void)
{
  ce(LOW);	// Guarantee CE is low on powerDown
  rf24_write_register(CONFIG,rf24_read_register(CONFIG) & ~_BV(PWR_UP));
}

/****************************************************************************/

//Power up now. Radio will not power down unless instructed by MCU for config changes etc.
void ICACHE_FLASH_ATTR
rf24_powerUp(void)
{
   uint8_t cfg = rf24_read_register(CONFIG);

	// if not powered up then power up and wait for the radio to initialize
   if (!(cfg & _BV(PWR_UP))){
      rf24_write_register(CONFIG,rf24_read_register(CONFIG) | _BV(PWR_UP));

	// For nRF24L01+ to go from power down mode to TX or RX mode it must first pass through stand-by mode.
	// There must be a delay of Tpd2stby (see Table 16.) after the nRF24L01+ leaves power down mode before
	// the CEis set high. - Tpd2stby can be up to 5ms per the 1.0 datasheet
      delay(5);

   }
}

/******************************************************************/
#if defined (FAILURE_HANDLING)
void ICACHE_FLASH_ATTR
rf24_errNotify(){
	IF_SERIAL_DEBUG(printf_P(PSTR("HARDWARE FAIL\r\n")));
	failureDetected = 1;
}
#endif
/******************************************************************/

//Similar to the previous write, clears the interrupt flags
bool ICACHE_FLASH_ATTR
rf24_write_v( const void* buf, uint8_t len, const bool multicast )
{
	//Start Writing
	rf24_startFastWrite(buf,len,multicast);

	//Wait until complete or failed
	#if defined (FAILURE_HANDLING)
		uint32_t timer = millis();
	#endif

	while( ! ( rf24_get_status()  & ( _BV(TX_DS) | _BV(MAX_RT) ))) {
		#if defined (FAILURE_HANDLING)
			if(millis() - timer > 75){
				errNotify();
				return 0;
			}
		#endif
	}

	ce(LOW);

	uint8_t status = rf24_write_register(STATUS,_BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

	//Max retries exceeded
  if( status & _BV(MAX_RT)){
	     flush_tx();	//Only going to be 1 packet int the FIFO at a time using this method, so just flush
	     return 0;
  }
	//TX OK 1 or 0
  return 1;
}

bool ICACHE_FLASH_ATTR
rf24_write( const void* buf, uint8_t len ){
	return rf24_writeBlocking(buf,len,0);
}
/****************************************************************************/

//For general use, the interrupt flags are not important to clear
bool ICACHE_FLASH_ATTR
rf24_writeBlocking( const void* buf, uint8_t len, uint32_t timeout )
{
	//Block until the FIFO is NOT full.
	//Keep track of the MAX retries and set auto-retry if seeing failures
	//This way the FIFO will fill up and allow blocking until packets go through
	//The radio will auto-clear everything in the FIFO as long as CE remains high

	uint32_t timer = millis();	//Get the time that the payload transmission started

	while( ( rf24_get_status()  & ( _BV(TX_FULL) ))) {	//Blocking only if FIFO is full. This will loop and block until TX is successful or timeout

		if( rf24_get_status() & _BV(MAX_RT)){	//If MAX Retries have been reached
			rf24_reUseTX();	//Set re-transmit and clear the MAX_RT interrupt flag
			if(millis() - timer > timeout){ return 0; }	//If this payload has exceeded the user-defined timeout, exit and return 0
		}
		#if defined (FAILURE_HANDLING)
			if(millis() - timer > (timeout+75) ){
				errNotify();
				return 0;
			}
		#endif

  	}

	//Start Writing
	rf24_startFastWrite(buf,len,0);	//Write the payload if a buffer is clear

	return 1;	//Return 1 to indicate successful transmission
}

/****************************************************************************/

void rf24_reUseTX(){
		rf24_write_register(STATUS,_BV(MAX_RT) );	//Clear max retry flag
		rf24_spiTrans( REUSE_TX_PL );
		ce(LOW);	//Re-Transfer packet
		ce(HIGH);
}

/****************************************************************************/

bool ICACHE_FLASH_ATTR
rf24_writeFast_noack( const void* buf, uint8_t len, const bool multicast )
{
	//Block until the FIFO is NOT full.
	//Keep track of the MAX retries and set auto-retry if seeing failures
	//Return 0 so the user can control the retrys and set a timer or failure counter if required
	//The radio will auto-clear everything in the FIFO as long as CE remains high

	#if defined (FAILURE_HANDLING)
		uint32_t timer = millis();
	#endif

