aniline/rf24-esp8266/user/RF24.c
	while( ( rf24_get_status()  & ( _BV(TX_FULL) ))) {	//Blocking only if FIFO is full. This will loop and block until TX is successful or fail

		if( rf24_get_status() & _BV(MAX_RT)){
	//reUseTX();	//Set re-transmit
			rf24_write_register(STATUS,_BV(MAX_RT) );	//Clear max retry flag
			return 0;	//Return 0. The previous payload has been retransmitted
	//From the user perspective, if you get a 0, just keep trying to send the same payload
		}
		#if defined (FAILURE_HANDLING)
			if(millis() - timer > 75 ){
				errNotify();
				return 0;
			}
		#endif
  	}
	//Start Writing
	rf24_startFastWrite(buf,len,multicast);

	return 1;
}

bool rf24_writeFast( const void* buf, uint8_t len ){
	return rf24_writeFast_noack(buf,len,0);
}

/****************************************************************************/

//Per the documentation, we want to set PTX Mode when not listening. Then all we do is write data and set CE high
//In this mode, if we can keep the FIFO buffers loaded, packets will transmit immediately (no 130us delay)
//Otherwise we enter Standby-II mode, which is still faster than standby mode
//Also, we remove the need to keep writing the config register over and over and delaying for 150 us each time if sending a stream of data

void rf24_startFastWrite( const void* buf, uint8_t len, const bool multicast){	//TMRh20

	//write_payload( buf,len);
	rf24_write_payload( buf, len,multicast ? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD ) ;
	ce(HIGH);

}


//Added the original startWrite back in so users can still use interrupts, ack payloads, etc
//Allows the library to pass all tests
void ICACHE_FLASH_ATTR
rf24_startWrite( const void* buf, uint8_t len, const bool multicast ){

	// Send the payload

	//write_payload( buf, len );
  rf24_write_payload( buf, len,multicast? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD ) ;
  ce(HIGH);
  #if defined(CORE_TEENSY) || !defined(ARDUINO)
	delayMicroseconds(10);
  #endif
  ce(LOW);


}

bool ICACHE_FLASH_ATTR
rf24_txStandBy(){
    #if defined (FAILURE_HANDLING)
		uint32_t timeout = millis();
	#endif
	while( ! (rf24_read_register(FIFO_STATUS) & _BV(TX_EMPTY)) ){
		if( rf24_get_status() & _BV(MAX_RT)){
			rf24_write_register(STATUS,_BV(MAX_RT) );
			ce(LOW);
			flush_tx();	//Non blocking, flush the data
			return 0;
		}
		#if defined (FAILURE_HANDLING)
			if( millis() - timeout > 75){
				errNotify();
				return 0;
			}
		#endif
	}

	ce(LOW);	//Set STANDBY-I mode
	return 1;
}

bool rf24_txStandBy_retry(uint32_t timeout){

	uint32_t start = millis();

	while( ! (rf24_read_register(FIFO_STATUS) & _BV(TX_EMPTY)) ){
		if( rf24_get_status() & _BV(MAX_RT)){
			rf24_write_register(STATUS,_BV(MAX_RT) );
				ce(LOW);	//Set re-transmit
				ce(HIGH);
				if(millis() - start >= timeout){
					ce(LOW); flush_tx(); return 0;
				}
		}
		#if defined (FAILURE_HANDLING)
			if( millis() - start > (timeout+75)){
				errNotify();
				return 0;
			}
		#endif
	}


	ce(LOW);	//Set STANDBY-I mode
	return 1;

}
/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_maskIRQ(bool tx, bool fail, bool rx){

	rf24_write_register(CONFIG, ( rf24_read_register(CONFIG) ) | fail << MASK_MAX_RT | tx << MASK_TX_DS | rx << MASK_RX_DR  );
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_getDynamicPayloadSize(void)
{
  uint8_t result = 0;

  csn(LOW);
  SPI_transfer( R_RX_PL_WID );
  result = SPI_transfer(0xff);
  csn(HIGH);

  if(result > 32) { flush_rx(); return 0; }
  return result;
}

/****************************************************************************/

bool ICACHE_FLASH_ATTR
rf24_available(void)
{
  return rf24_available_on_pipe(NULL);
}

/****************************************************************************/

bool rf24_available_on_pipe(uint8_t* pipe_num)
{

	//Check the FIFO buffer to see if data is waitng to be read

  if (!( rf24_read_register(FIFO_STATUS) & _BV(RX_EMPTY) )){

	// If the caller wants the pipe number, include that
    if ( pipe_num ){
	  uint8_t status = rf24_get_status();
      *pipe_num = ( status >> RX_P_NO ) & 0B111;
  	}
  	return 1;
  }


  return 0;


}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_read( void* buf, uint8_t len ){

	// Fetch the payload
  rf24_read_payload( buf, len );

	//Clear the two possible interrupt flags with one command
  rf24_write_register(STATUS,_BV(RX_DR) | _BV(MAX_RT) | _BV(TX_DS) );

}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_whatHappened(bool* tx_ok, bool* tx_fail, bool* rx_ready)
{
	// Read the status & reset the status in one easy call
	// Or is that such a good idea?
  uint8_t status = rf24_write_register(STATUS,_BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

	// Report to the user what happened
  *tx_ok = status & _BV(TX_DS);
  *tx_fail = status & _BV(MAX_RT);
  *rx_ready = status & _BV(RX_DR);
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_openWritingPipe(uint64_t value)
{
	// Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
	// expects it LSB first too, so we're good.

     rf24_write_register_v(RX_ADDR_P0, (uint8_t*)(&value), addr_width);
     rf24_write_register_v(TX_ADDR, (uint8_t*)(&value), addr_width);

	//const uint8_t max_payload_size = 32;
	//rf24_write_register(RX_PW_P0,min(payload_size,max_payload_size));
     rf24_write_register(RX_PW_P0,payload_size);
}

/****************************************************************************/
void ICACHE_FLASH_ATTR
rf24_openWritingPipe_v(const uint8_t *address)
{
	// Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
	// expects it LSB first too, so we're good.

  rf24_write_register_v(RX_ADDR_P0,address, addr_width);
  rf24_write_register_v(TX_ADDR, address, addr_width);

	//const uint8_t max_payload_size = 32;
	//rf24_write_register(RX_PW_P0,min(payload_size,max_payload_size));
  rf24_write_register(RX_PW_P0,payload_size);
}

