aniline/rf24-esp8266/user/RF24.c
/****************************************************************************/
static const uint8_t child_pipe[] PROGMEM =
{
  RX_ADDR_P0, RX_ADDR_P1, RX_ADDR_P2, RX_ADDR_P3, RX_ADDR_P4, RX_ADDR_P5
};
static const uint8_t child_payload_size[] PROGMEM =
{
  RX_PW_P0, RX_PW_P1, RX_PW_P2, RX_PW_P3, RX_PW_P4, RX_PW_P5
};
static const uint8_t child_pipe_enable[] PROGMEM =
{
  ERX_P0, ERX_P1, ERX_P2, ERX_P3, ERX_P4, ERX_P5
};

void ICACHE_FLASH_ATTR
rf24_openReadingPipe(uint8_t child, uint64_t address)
{
	// If this is pipe 0, cache the address.  This is needed because
	// openWritingPipe() will overwrite the pipe 0 address, so
	// startListening() will have to restore it.
  if (child == 0){
    memcpy(pipe0_reading_address,&address,addr_width);
  }

  if (child <= 6)
  {
	// For pipes 2-5, only write the LSB
    if ( child < 2 )
	 rf24_write_register_v(pgm_read_byte(&child_pipe[child]), (const uint8_t*)(&address), addr_width);
    else
	 rf24_write_register_v(pgm_read_byte(&child_pipe[child]), (const uint8_t*)(&address), 1);

    rf24_write_register(pgm_read_byte(&child_payload_size[child]),payload_size);

	// Note it would be more efficient to set all of the bits for all open
	// pipes at once.  However, I thought it would make the calling code
	// more simple to do it this way.
    rf24_write_register(EN_RXADDR,rf24_read_register(EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[child])));
  }
}

/****************************************************************************/
void ICACHE_FLASH_ATTR
rf24_setAddressWidth(uint8_t a_width){

	if(a_width -= 2){
		rf24_write_register(SETUP_AW,a_width%4);
		addr_width = (a_width%4) + 2;
	}

}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_openReadingPipe_v(uint8_t child, const uint8_t *address)
{
	// If this is pipe 0, cache the address.  This is needed because
	// openWritingPipe() will overwrite the pipe 0 address, so
	// startListening() will have to restore it.
  if (child == 0){
    memcpy(pipe0_reading_address,address,addr_width);
  }
  if (child <= 6)
  {
	// For pipes 2-5, only write the LSB
    if ( child < 2 ){
      rf24_write_register_v(pgm_read_byte(&child_pipe[child]), address, addr_width);
    }else{
      rf24_write_register_v(pgm_read_byte(&child_pipe[child]), address, 1);
	}
    rf24_write_register(pgm_read_byte(&child_payload_size[child]),payload_size);

	// Note it would be more efficient to set all of the bits for all open
	// pipes at once.  However, I thought it would make the calling code
	// more simple to do it this way.
    rf24_write_register(EN_RXADDR,rf24_read_register(EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[child])));

  }
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_closeReadingPipe( uint8_t pipe )
{
  rf24_write_register(EN_RXADDR,rf24_read_register(EN_RXADDR) & ~_BV(pgm_read_byte(&child_pipe_enable[pipe])));
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_toggle_features(void)
{
  csn(LOW);
  SPI_transfer( ACTIVATE );
  SPI_transfer( 0x73 );
  csn(HIGH);
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_enableDynamicPayloads(void)
{
	// Enable dynamic payload throughout the system

    rf24_toggle_features();
    rf24_write_register(FEATURE,rf24_read_register(FEATURE) | _BV(EN_DPL) );


  IF_SERIAL_DEBUG(printf("FEATURE=%i\r\n",rf24_read_register(FEATURE)));

	// Enable dynamic payload on all pipes
	//
	// Not sure the use case of only having dynamic payload on certain
	// pipes, so the library does not support it.
  rf24_write_register(DYNPD,rf24_read_register(DYNPD) | _BV(DPL_P5) | _BV(DPL_P4) | _BV(DPL_P3) | _BV(DPL_P2) | _BV(DPL_P1) | _BV(DPL_P0));

  dynamic_payloads_enabled = true;
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_enableAckPayload(void)
{
	//
	// enable ack payload and dynamic payload features
	//

    rf24_toggle_features();
    rf24_write_register(FEATURE,rf24_read_register(FEATURE) | _BV(EN_ACK_PAY) | _BV(EN_DPL) );

  IF_SERIAL_DEBUG(printf("FEATURE=%i\r\n",rf24_read_register(FEATURE)));

	//
	// Enable dynamic payload on pipes 0 & 1
	//

  rf24_write_register(DYNPD,rf24_read_register(DYNPD) | _BV(DPL_P1) | _BV(DPL_P0));
  dynamic_payloads_enabled = true;
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_enableDynamicAck(void){
	//
	// enable dynamic ack features
	//
    rf24_toggle_features();
    rf24_write_register(FEATURE,rf24_read_register(FEATURE) | _BV(EN_DYN_ACK) );

  IF_SERIAL_DEBUG(printf("FEATURE=%i\r\n",rf24_read_register(FEATURE)));


}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_writeAckPayload(uint8_t pipe, const void* buf, uint8_t len)
{
     const uint8_t* current = (const uint8_t*)(buf);

  uint8_t data_len = min(len,32);

  csn(LOW);
  SPI_transfer(W_ACK_PAYLOAD | ( pipe & 0B111 ) );

  while ( data_len-- )
    SPI_transfer(*current++);

  csn(HIGH);
}

/****************************************************************************/

bool ICACHE_FLASH_ATTR
rf24_isAckPayloadAvailable(void)
{
  return ! rf24_read_register(FIFO_STATUS) & _BV(RX_EMPTY);
}

/****************************************************************************/

bool ICACHE_FLASH_ATTR
rf24_isPVariant(void)
{
  return p_variant ;
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_setAutoAck(bool enable)
{
  if ( enable )
    rf24_write_register(EN_AA, 0B111111);
  else
    rf24_write_register(EN_AA, 0);
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_setAutoAck_on_pipe( uint8_t pipe, bool enable )
{
  if ( pipe <= 6 )
  {
    uint8_t en_aa = rf24_read_register( EN_AA ) ;
    if( enable )
    {
      en_aa |= _BV(pipe) ;
    }
    else
    {
      en_aa &= ~_BV(pipe) ;
    }
    rf24_write_register( EN_AA, en_aa ) ;
  }
}

