aniline/rf24-esp8266/user/RF24.c
/****************************************************************************/

bool ICACHE_FLASH_ATTR
rf24_testCarrier(void)
{
  return ( rf24_read_register(CD) & 1 );
}

/****************************************************************************/

bool ICACHE_FLASH_ATTR
rf24_testRPD(void)
{
  return ( rf24_read_register(RPD) & 1 ) ;
}

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_setPALevel(uint8_t level)
{

  uint8_t setup = rf24_read_register(RF_SETUP) & 0b11111000;

  if(level > 3){	// If invalid level, go to max PA
	  level = (RF24_PA_MAX << 1) + 1;	// +1 to support the SI24R1 chip extra bit
  }else{
	  level = (level << 1) + 1;	// Else set level as requested
  }


  rf24_write_register( RF_SETUP, setup |= level ) ;	// Write it to the chip
}

/****************************************************************************/

uint8_t ICACHE_FLASH_ATTR
rf24_getPALevel(void)
{

  return (rf24_read_register(RF_SETUP) & (_BV(RF_PWR_LOW) | _BV(RF_PWR_HIGH))) >> 1 ;
}

/****************************************************************************/

bool ICACHE_FLASH_ATTR
rf24_setDataRate(rf24_datarate_e speed)
{
  bool result = false;
  uint8_t setup = rf24_read_register(RF_SETUP) ;

	// HIGH and LOW '00' is 1Mbs - our default
  setup &= ~(_BV(RF_DR_LOW) | _BV(RF_DR_HIGH)) ;
  if( speed == RF24_250KBPS )
  {
	// Must set the RF_DR_LOW to 1; RF_DR_HIGH (used to be RF_DR) is already 0
	// Making it '10'.
    setup |= _BV( RF_DR_LOW ) ;
  }
  else
  {
	// Set 2Mbs, RF_DR (RF_DR_HIGH) is set 1
	// Making it '01'
    if ( speed == RF24_2MBPS )
    {
      setup |= _BV(RF_DR_HIGH);
    }
  }
  rf24_write_register(RF_SETUP,setup);

	// Verify our result
  if ( rf24_read_register(RF_SETUP) == setup )
  {
    result = true;
  }

  return result;
}

#ifndef MINIMAL_NO_FULL_API
/****************************************************************************/

rf24_datarate_e ICACHE_FLASH_ATTR
rf24_getDataRate( void )
{
  rf24_datarate_e result ;
  uint8_t dr = rf24_read_register(RF_SETUP) & (_BV(RF_DR_LOW) | _BV(RF_DR_HIGH));

	// switch uses RAM (evil!)
	// Order matters in our case below
  if ( dr == _BV(RF_DR_LOW) )
  {
	// '10' = 250KBPS
    result = RF24_250KBPS ;
  }
  else if ( dr == _BV(RF_DR_HIGH) )
  {
	// '01' = 2MBPS
    result = RF24_2MBPS ;
  }
  else
  {
	// '00' = 1MBPS
    result = RF24_1MBPS ;
  }
  return result ;
}
#endif

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_setCRCLength(rf24_crclength_e length)
{
  uint8_t config = rf24_read_register(CONFIG) & ~( _BV(CRCO) | _BV(EN_CRC)) ;

	// switch uses RAM (evil!)
  if ( length == RF24_CRC_DISABLED )
  {
	// Do nothing, we turned it off above.
  }
  else if ( length == RF24_CRC_8 )
  {
    config |= _BV(EN_CRC);
  }
  else
  {
    config |= _BV(EN_CRC);
    config |= _BV( CRCO );
  }
  rf24_write_register( CONFIG, config ) ;
}

#ifndef MINIMAL_NO_FULL_API
/****************************************************************************/

rf24_crclength_e ICACHE_FLASH_ATTR
rf24_getCRCLength(void)
{
  rf24_crclength_e result = RF24_CRC_DISABLED;
  uint8_t config = rf24_read_register(CONFIG) & ( _BV(CRCO) | _BV(EN_CRC)) ;

  if ( config & _BV(EN_CRC ) )
  {
    if ( config & _BV(CRCO) )
      result = RF24_CRC_16;
    else
      result = RF24_CRC_8;
  }

  return result;
}
#endif

/****************************************************************************/

void ICACHE_FLASH_ATTR
rf24_disableCRC( void )
{
  uint8_t disable = rf24_read_register(CONFIG) & ~_BV(EN_CRC) ;
  rf24_write_register( CONFIG, disable ) ;
}

/****************************************************************************/
void ICACHE_FLASH_ATTR
rf24_setRetries(uint8_t delay, uint8_t count)
{
 rf24_write_register(SETUP_RETR,(delay&0xf)<<ARD | (count&0xf)<<ARC);
}

bool ICACHE_FLASH_ATTR
rf24_isValid() { return ce_pin != 0xff && csn_pin != 0xff; }
